/******************************************************************************
Лаб 9 (25.11.24) задание 1
На вход подается  строка необходимо определить символ который чаще всего 
встречается в комбинации а*б, где * это один символ
Строка только символы латинского, любого регистра, но регистр не имеет значение
*******************************************************************************/
using System;
class Program
{
    static void Main()
    {
        string a = (Console.ReadLine()).ToLower();
        char most = '0';
        int max = 0;
        for (int i = 0; i < a.Length - 2; i++)
        {
            if (a[i] == 'a' && a[i + 2] == 'b')
            {
                char mid = a[i + 1];
                int curr = 0;
                for (int j = 0; j < a.Length - 2; j++)
                {
                    if (a[j] == 'a' && a[j + 2] == 'b' && a[j + 1] == mid)
                    {
                        curr++;
                    }
                }
                if (curr > max)
                {
                    max = curr;
                    most = mid;
                }
            }
        }
        Console.WriteLine(most);
    }
}